src/cf/InformationRegisters/НапоминанияПользователя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>НапоминанияПользователя</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СрокНапоминания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособУстановкиВремениНапоминания</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыУстановкиВремениНапоминания</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтервалВремениНапоминания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяРеквизитаИсточника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расписание</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеИсточника</Name>
					<Comment>Представление источника</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВремяСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПредметНапоминания</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/CommonModules/НапоминанияПользователяСлужебныйКлиент/Ext/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

Процедура ОбработатьОткрытиеОповещения(Контекст) Экспорт
	
	Если ЗначениеЗаполнено(Контекст.Источник) 
		Или НапоминанияПользователяКлиентСервер.ЭтоНавигационнаяСсылкаСообщения(Контекст.НавигационнаяСсылка) Тогда
		ПараметрыНапоминания = НапоминанияПользователяКлиентСервер.ОписаниеНапоминания(Контекст);
		
		КлючНапоминания = НапоминанияПользователяВызовСервера.ПолучитьКлючЗаписиИОтключитьНапоминание(ПараметрыНапоминания);
		
		НапоминанияПользователяКлиент.УдалитьЗаписьИзКэшаОповещений(ПараметрыНапоминания);
		Оповестить("Запись_НапоминанияПользователя", Новый Структура, КлючНапоминания);
		ОповеститьОбИзменении(Тип("РегистрСведенийКлючЗаписи.НапоминанияПользователя"));
		ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(Контекст.НавигационнаяСсылка);
	Иначе
		ОткрытьФорму("РегистрСведений.НапоминанияПользователя.Форма.Напоминание", Новый Структура("ДанныеКлюча", Контекст));	
	КонецЕсли;
	
КонецПроцедуры

Процедура Напомнить(Ссылка, Параметры) Экспорт
	ПараметрыФормы = Новый Структура("Источник", Ссылка);
	ОткрытьФорму("РегистрСведений.НапоминанияПользователя.Форма.Напоминание", 
		ПараметрыФормы, Параметры.Форма);
КонецПроцедуры

#Область Обсуждения

Процедура ДобавитьКомандыОбсуждения(ПараметрыКоманд, Команды, КомандаПоУмолчанию) Экспорт
	
	Если ТипЗнч(ПараметрыКоманд.Сообщение) <> Тип("СообщениеСистемыВзаимодействия") Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыРаботыКлиента = СтандартныеПодсистемыКлиент.ПараметрыРаботыКлиента();
	Если Не ПараметрыРаботыКлиента.ИспользуютсяНапоминанияПользователя Тогда
		Возврат;
	КонецЕсли;
		
	КомандыНапоминаний = Новый ОписаниеКомандыСистемыВзаимодействия(Новый Массив, НСтр("ru='Напомнить...'"));
	КомандыНапоминаний.Картинка = ?(ПараметрыРаботыКлиента.ОтображатьНапоминанияВЦентреОповещений, 
		БиблиотекаКартинок.ЦентрОповещений, БиблиотекаКартинок.Напоминание);
	
	ДобавитьКоманду(КомандыНапоминаний.Команда, ПараметрыКоманд, "НапомнитьЧерезЧас", НСтр("ru='Через час'"));
	ДобавитьКоманду(КомандыНапоминаний.Команда, ПараметрыКоманд, "НапомнитьЧерез2Часа", НСтр("ru='Через 2 часа'"));
	ДобавитьКоманду(КомандыНапоминаний.Команда, ПараметрыКоманд, "НапомнитьЧерез3Часа", НСтр("ru='Через 4 часа'"));
	ДобавитьКоманду(КомандыНапоминаний.Команда, ПараметрыКоманд, "НапомнитьЗавтраУтром", НСтр("ru='Завтра утром'"));
	ДобавитьКоманду(КомандыНапоминаний.Команда, ПараметрыКоманд, "НапомнитьНачалоСледующейНедели", НСтр("ru='Начало следующей недели'"));
	ДобавитьРазделитель(КомандыНапоминаний.Команда);
	ДобавитьКоманду(КомандыНапоминаний.Команда, ПараметрыКоманд, "НастройкиНапоминаний", НСтр("ru='Настройки...'"));
	
	Команды.Добавить(КомандыНапоминаний);

КонецПроцедуры

Процедура СоздатьНапоминание(ДополнительныеПараметры) Экспорт
	
	Если ДополнительныеПараметры.ИдентификаторКоманды = "НастройкиНапоминаний" Тогда
		НапоминанияПользователяКлиент.ОткрытьНастройки();
		Возврат;
	КонецЕсли;
	
	ВремяНапоминания = ОбщегоНазначенияКлиент.ДатаСеанса();
	Если ДополнительныеПараметры.ИдентификаторКоманды = "НапомнитьЧерезЧас" Тогда
		ВремяНапоминания = ВремяНапоминания + 60*60;
	ИначеЕсли ДополнительныеПараметры.ИдентификаторКоманды = "НапомнитьЧерез2Часа" Тогда
		ВремяНапоминания = ВремяНапоминания + 2*60*60;
	ИначеЕсли ДополнительныеПараметры.ИдентификаторКоманды = "НапомнитьЧерез3Часа" Тогда
		ВремяНапоминания = ВремяНапоминания + 3*60*60;
	ИначеЕсли ДополнительныеПараметры.ИдентификаторКоманды = "НапомнитьЗавтраУтром" Тогда
		ВремяНапоминания = КонецДня(ВремяНапоминания) + 9*60*60;
	ИначеЕсли ДополнительныеПараметры.ИдентификаторКоманды = "НапомнитьНачалоСледующейНедели" Тогда
		ВремяНапоминания = КонецНедели(ВремяНапоминания) + 9*60*60;
	КонецЕсли;           
	
	НапоминанияПользователяКлиент.НапомнитьВУказанноеВремя(НСтр("ru='Напоминание об отложенном сообщении'"), 
		ВремяНапоминания, , "e1ccs/data/msg?id=" + ДополнительныеПараметры.ИдентификаторСообщения);
		
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьКоманду(КомандыПодменю, ПараметрыСообщения, ИдентификаторКоманды, Представление)
	
	ПараметрыКоманды = Новый Структура;
	ПараметрыКоманды.Вставить("ТекстСообщения", ПараметрыСообщения.Сообщение.Текст);
	ПараметрыКоманды.Вставить("ИдентификаторСообщения", ПараметрыСообщения.Сообщение.Идентификатор);
	ПараметрыКоманды.Вставить("ИдентификаторКоманды", ИдентификаторКоманды);
	КомандаНапоминания = Новый ОписаниеКомандыСистемыВзаимодействия(
		Новый ОписаниеОповещения("СоздатьНапоминание", ЭтотОбъект, ПараметрыКоманды), Представление);
	КомандыПодменю.Добавить(КомандаНапоминания);
	
КонецПроцедуры

Процедура ДобавитьРазделитель(КомандыПодменю)
	Разделитель = Новый ОписаниеКомандыСистемыВзаимодействия(Неопределено);
	КомандыПодменю.Добавить(Разделитель);
КонецПроцедуры

#КонецОбласти
